/*1) В класс односвязного списка (см. код в Тимс) добавить метод, добавляющий элемент к началу (голове) списка.*/





/*2) Написать метод void DelRange(int pos1, int pos2), который удаляет все элементы 2-св. списка,
начиная с позиции pos1 и до pos2 (включительно). Не использовать метод Del(), а вручную связать элементы списка (новых соседей)!
*/



/*3) Создать шаблонный класс динамического массива (см. урок №2, с. 56). Добавить в этот класс методы для добавления элемента к 
массиву и удаления элемента из массива.
Добавить метод для расчета суммы элементов этого массива Sum(). Создать объекты этого класса, инкапсулирующие массивы типа int, double, char и Point.
Для каждого из этих объектов вызвать метод Sum().
Point - это класс, содержащий 2 поля (координаты точки): int X и int Y.*/

